[
  {
    "id": 0,
    "url": "averys-pet-sitting",
    "image": "averyspetsittinglogo1.png",
    "alt": "Avery's Pet Sitting Logo",
    "titleFirst": "Avery's",
    "titleSecond": "Pet Sitting",
    "description": "A dog and cat sitting portfolio project with the T3 Stack paradigm in mind. This application utilizes Next.js, TypeScript, Tailwind CSS, Sass, jQuery, and functionality for contacting Avery. The website is responsively built using mobile-first practices, and has a clean, modern design. The appication was built following a Figma wireframing for UI/UX design in mind. Avery's website is hosted on Vercel, and is also SEO optimized.",
    "demo": "https://www.averyspetsitting.com/",
    "code": "https://github.com/MitchellGruner/Averys-Pet-Sitting"
  },
  {
    "id": 1,
    "url": "quiz-list",
    "image": "quizlist1.png",
    "alt": "Quiz List Logo",
    "titleFirst": "Quiz",
    "titleSecond": "List",
    "description": "A quiz game created using React.js that allows users to guess an answer to a question in an accordion-style dropdown. If the answer is correct, the user is allowed to continue playing to try and beat their high score. However, if a question is not correctly answered, the game is over and their score gets set to zero.",
    "demo": "https://master--vermillion-narwhal-b9ab97.netlify.app/",
    "code": "https://github.com/MitchellGruner/QuizList",
    "video": "https://www.youtube.com/watch?v=0AWLYyrbZ-Y&t=7s"
  },
  {
    "id": 2,
    "url": "little-lemon",
    "image": "littlelemonlogo1.png",
    "alt": "Little Lemon API Logo",
    "titleFirst": "Little Lemon",
    "titleSecond": "API",
    "description": "This is from the Meta Back-End Developer Course offered through Coursera. This is a fully functioning back-end API project using Django and MySQL for a fictional restaurant. This API allows certain users to browse, add, and edit menu items, place orders, browse orders, and assign delivery crew to orders; the delivery crew can then finally deliver the orders.",
    "code": "https://github.com/MitchellGruner/LittleLemonAPI"
  }
]